## Terraform Plan for Production Environment

**Environment**: Production
**Workspace**: production
**Branch**: main
**Triggered by**: PR #135
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_key_pair.environment_key will be created
  + resource "aws_key_pair" "environment_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "tf-playground-production-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags            = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "tf-playground-production-key"
          + "Project"     = "tf-playground"
          + "Purpose"     = "centralized-ssh-key"
        }
      + tags_all        = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "tf-playground-production-key"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Purpose"     = "centralized-ssh-key"
          + "Tier"        = "production"
        }
    }

  # module.blue_asg[0].data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages (ADD CloudWatch agent)
            yum install -y python3 python3-pip git mariadb1011-client-utils jq amazon-cloudwatch-agent
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python requests psutil boto3
            
            # Get instance ID and set as environment variable
            INSTANCE_ID=$(curl -s http://169.254.169.254/latest/meta-data/instance-id)
            export INSTANCE_ID
            
            # Create enhanced application files with structured logging
            cat > app.py << 'EOF'
            from flask import Flask, jsonify, request
            import mysql.connector
            import os
            import psutil
            import time
            import sys
            from datetime import datetime
            import requests
            import logging
            import json
            
            app = Flask(__name__)
            
            # Configure structured logging
            logging.basicConfig(
                level=logging.INFO,
                format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
                handlers=[
                    logging.FileHandler('/var/log/flask-app.log'),
                    logging.StreamHandler()  # Also log to stdout for CloudWatch
                ]
            )
            logger = logging.getLogger(__name__)
            
            # Get database password from Secrets Manager
            import boto3
            
            def get_instance_id():
                """Get instance ID from metadata service"""
                try:
                    import requests
                    response = requests.get('http://169.254.169.254/latest/meta-data/instance-id', timeout=5)
                    return response.text if response.status_code == 200 else 'unknown'
                except Exception as e:
                    print(f"Failed to get instance ID: {e}")
                    return 'unknown'
            
            def get_db_password():
                try:
                    # Get region from instance metadata
                    import requests
                    region_response = requests.get('http://169.254.169.254/latest/meta-data/placement/region', timeout=5)
                    region = region_response.text if region_response.status_code == 200 else 'us-east-2'
                    
                    client = boto3.client('secretsmanager', region_name=region)
                    # Use centralized database password secret
                    secret_name = '/tf-playground/all/db-pword'
                    response = client.get_secret_value(SecretId=secret_name)
                    
                    # The password is stored as a plain string, not JSON
                    return response['SecretString']
                except Exception as e:
                    print(f"Failed to get password from Secrets Manager: {e}")
                    return None  # No fallback - let the application handle the error
            
            # Database configuration
            password = get_db_password()
            if password is None:
                print("ERROR: Could not retrieve database password from Secrets Manager")
                sys.exit(1)
            
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': password,
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            def check_database_connection():
                """Check if database connection is working"""
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True
                except Exception as e:
                    print(f"Database connection failed: {e}")
                    return False
            
            def check_application_readiness():
                """Check if application is ready to serve requests"""
                try:
                    # Just check if database is responding, don't check for specific data
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')  # Simple connectivity test
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True  # If we can connect and execute a query, we're ready
                except Exception as e:
                    print(f"Application readiness check failed: {e}")
                    return False
            
            def check_memory_usage():
                """Check if memory usage is within acceptable limits"""
                memory = psutil.virtual_memory()
                return memory.percent < 90  # Less than 90% memory usage
            
            def check_disk_space():
                """Check if disk space is sufficient"""
                disk = psutil.disk_usage('/')
                return disk.percent < 90  # Less than 90% disk usage
            
            def check_response_times():
                """Check if application response times are acceptable"""
                try:
                    start_time = time.time()
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    response_time = time.time() - start_time
                    return response_time < 2.0  # Less than 2 seconds
                except Exception:
                    return False
            
            # Request logging middleware
            @app.before_request
            def log_request():
                request.start_time = time.time()
            
            @app.after_request
            def log_response(response):
                duration = time.time() - request.start_time
                
                log_data = {
                    "timestamp": datetime.utcnow().isoformat(),
                    "method": request.method,
                    "path": request.path,
                    "status_code": response.status_code,
                    "duration_ms": round(duration * 1000, 2),
                    "user_agent": request.headers.get('User-Agent'),
                    "ip_address": request.remote_addr,
                    "deployment_color": '${deployment_color}',
                    "instance_id": get_instance_id()
                }
                
                logger.info(json.dumps(log_data))
                return response
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify({
                        'contacts': contacts,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    })
                except Exception as e:
                    logger.error(f"Database query failed: {str(e)}")
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                """Enhanced health check endpoint"""
                try:
                    # Database connectivity check
                    db_status = check_database_connection()
                    
                    # Application readiness check
                    app_status = check_application_readiness()
                    
                    # System health checks
                    memory_status = check_memory_usage()
                    disk_status = check_disk_space()
                    response_status = check_response_times()
                    
                    # Overall health status
                    all_healthy = all([db_status, app_status, memory_status, disk_status, response_status])
                    
                    health_data = {
                        'status': 'healthy' if all_healthy else 'unhealthy',
                        'checks': {
                            'database_connectivity': db_status,
                            'application_readiness': app_status,
                            'memory_usage': memory_status,
                            'disk_space': disk_status,
                            'response_times': response_status
                        },
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    }
                    
                    logger.info(f"Health check: {json.dumps(health_data)}")
                    return jsonify(health_data), 200 if all_healthy else 503
                except Exception as e:
                    logger.error(f"Health check failed: {str(e)}")
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/health/simple')
            def health_simple():
                """Simple health check for load balancer target groups"""
                try:
                    # Basic application check - just verify the app is running
                    # Don't check database or other services to keep it simple and fast
                    return jsonify({
                        'status': 'healthy',
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id(),
                        'message': 'Application is running'
                    }), 200
                except Exception as e:
                    logger.error(f"Simple health check failed: {str(e)}")
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    }), 500
            
            @app.route('/deployment/validate')
            def deployment_validation():
                """Comprehensive validation for new deployments"""
                try:
                    checks = {
                        'database_connectivity': check_database_connection(),
                        'application_functionality': check_application_readiness(),
                        'memory_usage': check_memory_usage(),
                        'disk_space': check_disk_space(),
                        'response_times': check_response_times()
                    }
                    
                    all_passed = all(checks.values())
                    
                    validation_data = {
                        'deployment_ready': all_passed,
                        'checks': checks,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    }
                    
                    logger.info(f"Deployment validation: {json.dumps(validation_data)}")
                    return jsonify(validation_data), 200 if all_passed else 503
                except Exception as e:
                    logger.error(f"Deployment validation failed: {str(e)}")
                    return jsonify({
                        'deployment_ready': False,
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/info')
            def info():
                """Instance information endpoint"""
                try:
                    memory = psutil.virtual_memory()
                    disk = psutil.disk_usage('/')
                    
                    return jsonify({
                        'deployment_color': '${deployment_color}',
                        'instance_id': get_instance_id(),
                        'system_info': {
                            'memory_usage_percent': memory.percent,
                            'disk_usage_percent': disk.percent,
                            'cpu_count': psutil.cpu_count(),
                            'uptime': time.time() - psutil.boot_time()
                        },
                        'timestamp': datetime.utcnow().isoformat()
                    })
                except Exception as e:
                    logger.error(f"Info endpoint failed: {str(e)}")
                    return jsonify({'error': str(e)}), 500
            
            # Chaos testing endpoints
            @app.route('/error/500')
            def generate_500_error():
                logger.error("Intentional 500 error generated for testing")
                return {"error": "Intentional server error"}, 500
            
            @app.route('/error/slow')
            def generate_slow_response():
                logger.warning("Intentional slow response generated for testing")
                time.sleep(3)  # Simulate slow database query
                return {"message": "Slow response completed"}
            
            @app.route('/error/db')
            def generate_db_error():
                logger.error("Intentional database error generated for testing")
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute("SELECT * FROM nonexistent_table")
                    cursor.fetchall()
                    cursor.close()
                    conn.close()
                except Exception as e:
                    logger.error(f"Database error: {str(e)}")
                    return {"error": "Database error", "details": str(e)}, 500
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Configure CloudWatch agent
            cat > /opt/aws/amazon-cloudwatch-agent/etc/amazon-cloudwatch-agent.json << 'EOF'
            {
              "logs": {
                "logs_collected": {
                  "files": {
                    "collect_list": [
                      {
                        "file_path": "/var/log/flask-app.log",
                        "log_group_name": "${application_log_group_name}",
                        "log_stream_name": "{instance_id}",
                        "timezone": "UTC"
                      },
                      {
                        "file_path": "/var/log/messages",
                        "log_group_name": "${system_log_group_name}",
                        "log_stream_name": "{instance_id}",
                        "timezone": "UTC"
                      }
                    ]
                  }
                }
              }
            }
            EOF
            
            # Start CloudWatch agent
            /opt/aws/amazon-cloudwatch-agent/bin/amazon-cloudwatch-agent-ctl \
              -a fetch-config \
              -m ec2 \
              -s \
              -c file:/opt/aws/amazon-cloudwatch-agent/etc/amazon-cloudwatch-agent.json
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            RestartSec=10
            StandardOutput=append:/var/log/flask-app.log
            StandardError=append:/var/log/flask-app.log
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
            
            # Wait for the application to start up
            echo "Waiting for application to start up..." >> /var/log/webapp-deployment.log
            sleep 30
            
            # Verify the application is running
            for i in {1..10}; do
                if curl -f http://localhost:8080/health/simple > /dev/null 2>&1; then
                    echo "Application is running and responding to health checks" >> /var/log/webapp-deployment.log
                    break
                else
                    echo "Attempt $i: Application not yet ready, waiting..." >> /var/log/webapp-deployment.log
                    sleep 10
                fi
            done
            
            # Create a simple health check script
            cat > /usr/local/bin/health-check.sh << 'EOF'
            #!/bin/bash
            curl -f http://localhost:8080/health > /dev/null 2>&1
            exit $?
            EOF
            
            chmod +x /usr/local/bin/health-check.sh
            
            # Log deployment information
            echo "Deployment completed for ${deployment_color} environment at $(date)" >> /var/log/webapp-deployment.log
            echo "Instance ID: $(curl -s http://169.254.169.254/latest/meta-data/instance-id)" >> /var/log/webapp-deployment.log
            echo "Deployment Color: ${deployment_color}" >> /var/log/webapp-deployment.log
            echo "Application startup sequence completed" >> /var/log/webapp-deployment.log
        EOT
      + vars     = {
          + "application_log_group_name" = "/aws/application/tf-playground/production"
          + "db_host"                    = (known after apply)
          + "db_name"                    = "tfplayground_prod"
          + "db_password"                = (sensitive value)
          + "db_user"                    = (sensitive value)
          + "deployment_color"           = "blue"
          + "system_log_group_name"      = "/aws/ec2/tf-playground/production"
        }
    }

  # module.blue_asg[0].aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "production-blue-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "blue"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "production-blue-asg"
        }

      + traffic_source (known after apply)
    }

  # module.blue_asg[0].aws_iam_instance_profile.asg will be created
  + resource "aws_iam_instance_profile" "asg" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "production-blue-asg-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "production-blue-asg-role"
      + tags_all    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.blue_asg[0].aws_iam_policy.asg_rds will be created
  + resource "aws_iam_policy" "asg_rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to interact with RDS database"
      + id               = (known after apply)
      + name             = "production-blue-asg-rds-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:rds:us-east-2:123324351829:db:production-*",
                          + "arn:aws:rds-db:us-east-2:123324351829:dbuser:production-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "production-blue-asg-rds-policy"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-asg-rds-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.blue_asg[0].aws_iam_policy.asg_secrets will be created
  + resource "aws_iam_policy" "asg_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to access database credentials in Secrets Manager"
      + id               = (known after apply)
      + name             = "production-blue-asg-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/database/credentials-*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/db-pword",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/db-pword-*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/db-pword*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/ssh-key*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/ssh-key-public*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "production-blue-asg-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-asg-secrets-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.blue_asg[0].aws_iam_role.asg will be created
  + resource "aws_iam_role" "asg" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-blue-asg-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "production-blue-asg-role"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-asg-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.blue_asg[0].aws_iam_role_policy.asg_cloudwatch will be created
  + resource "aws_iam_role_policy" "asg_cloudwatch" {
      + id          = (known after apply)
      + name        = "production-blue-asg-cloudwatch-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/*",
                          + "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.blue_asg[0].aws_iam_role_policy_attachment.asg_rds will be created
  + resource "aws_iam_role_policy_attachment" "asg_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-blue-asg-role"
    }

  # module.blue_asg[0].aws_iam_role_policy_attachment.asg_secrets will be created
  + resource "aws_iam_role_policy_attachment" "asg_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-blue-asg-role"
    }

  # module.blue_asg[0].aws_iam_role_policy_attachment.asg_ssm will be created
  + resource "aws_iam_role_policy_attachment" "asg_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "production-blue-asg-role"
    }

  # module.blue_asg[0].aws_launch_template.asg will be created
  + resource "aws_launch_template" "asg" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0c02fb55956c7d316"
      + instance_type   = "t3.micro"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "production-blue-lt"
      + tags            = {
          + "Name" = "production-blue-launch-template"
        }
      + tags_all        = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-launch-template"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "production-blue-asg-profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "DeploymentColor" = "blue"
              + "Environment"     = "production"
              + "Name"            = "production-blue-instance"
            }
        }
    }

  # module.database.aws_db_instance.database will be created
  + resource "aws_db_instance" "database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tfplayground_prod"
      + db_subnet_group_name                  = "production-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "production-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "production-database"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + timezone                              = (known after apply)
      + username                              = "tfplayground_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.database will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "production-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "production-db-subnet-group"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-db-subnet-group"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_security_group_rule.database_ecs_ingress[0] will be created
  + resource "aws_security_group_rule" "database_ecs_ingress" {
      + description              = "Allow ECS tasks to access database on port 3306"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.database.aws_security_group_rule.database_webserver_ingress[0] will be created
  + resource "aws_security_group_rule" "database_webserver_ingress" {
      + description              = "Allow webservers to access database on port 3306"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.ecs[0].aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "production-ecs-cluster"
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-cluster"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-cluster"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs[0].aws_ecs_service.blue will be created
  + resource "aws_ecs_service" "blue" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "production-blue-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-service"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-service"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "flask-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs[0].aws_ecs_service.green will be created
  + resource "aws_ecs_service" "green" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "production-green-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-service"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-service"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "flask-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs[0].aws_ecs_task_definition.blue will be created
  + resource "aws_ecs_task_definition" "blue" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "production-blue-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-task"
          + "Project"     = "tf-playground"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-task"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs[0].aws_ecs_task_definition.green will be created
  + resource "aws_ecs_task_definition" "green" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "production-green-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-task"
          + "Project"     = "tf-playground"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-task"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs[0].aws_iam_policy.cloudwatch_logs_access will be created
  + resource "aws_iam_policy" "cloudwatch_logs_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS tasks to write to CloudWatch Logs"
      + id               = (known after apply)
      + name             = "production-cloudwatch-logs-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-2:*:log-group:/aws/application/tf-playground/production:*",
                          + "arn:aws:logs:us-east-2:*:log-group:/aws/application/tf-playground/production",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ecs[0].aws_iam_policy.ecs_exec_access will be created
  + resource "aws_iam_policy" "ecs_exec_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS tasks to use ECS Exec"
      + id               = (known after apply)
      + name             = "production-ecs-exec-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ecs[0].aws_iam_policy.parameter_store_access will be created
  + resource "aws_iam_policy" "parameter_store_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS tasks to access Parameter Store"
      + id               = (known after apply)
      + name             = "production-parameter-store-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-2:*:parameter/tf-playground/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ecs[0].aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-execution-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-execution-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs[0].aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-task-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "production-ecs-task-execution-role"
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_cloudwatch_logs will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_cloudwatch_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ecs-task-role"
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_ecs_exec will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_ecs_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ecs-task-role"
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_parameter_store will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_parameter_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ecs-task-role"
    }

  # module.ecs[0].aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "production-ecs-tasks-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-tasks-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ecs-tasks-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.green_asg[0].data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages (ADD CloudWatch agent)
            yum install -y python3 python3-pip git mariadb1011-client-utils jq amazon-cloudwatch-agent
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python requests psutil boto3
            
            # Get instance ID and set as environment variable
            INSTANCE_ID=$(curl -s http://169.254.169.254/latest/meta-data/instance-id)
            export INSTANCE_ID
            
            # Create enhanced application files with structured logging
            cat > app.py << 'EOF'
            from flask import Flask, jsonify, request
            import mysql.connector
            import os
            import psutil
            import time
            import sys
            from datetime import datetime
            import requests
            import logging
            import json
            
            app = Flask(__name__)
            
            # Configure structured logging
            logging.basicConfig(
                level=logging.INFO,
                format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
                handlers=[
                    logging.FileHandler('/var/log/flask-app.log'),
                    logging.StreamHandler()  # Also log to stdout for CloudWatch
                ]
            )
            logger = logging.getLogger(__name__)
            
            # Get database password from Secrets Manager
            import boto3
            
            def get_instance_id():
                """Get instance ID from metadata service"""
                try:
                    import requests
                    response = requests.get('http://169.254.169.254/latest/meta-data/instance-id', timeout=5)
                    return response.text if response.status_code == 200 else 'unknown'
                except Exception as e:
                    print(f"Failed to get instance ID: {e}")
                    return 'unknown'
            
            def get_db_password():
                try:
                    # Get region from instance metadata
                    import requests
                    region_response = requests.get('http://169.254.169.254/latest/meta-data/placement/region', timeout=5)
                    region = region_response.text if region_response.status_code == 200 else 'us-east-2'
                    
                    client = boto3.client('secretsmanager', region_name=region)
                    # Use centralized database password secret
                    secret_name = '/tf-playground/all/db-pword'
                    response = client.get_secret_value(SecretId=secret_name)
                    
                    # The password is stored as a plain string, not JSON
                    return response['SecretString']
                except Exception as e:
                    print(f"Failed to get password from Secrets Manager: {e}")
                    return None  # No fallback - let the application handle the error
            
            # Database configuration
            password = get_db_password()
            if password is None:
                print("ERROR: Could not retrieve database password from Secrets Manager")
                sys.exit(1)
            
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': password,
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            def check_database_connection():
                """Check if database connection is working"""
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True
                except Exception as e:
                    print(f"Database connection failed: {e}")
                    return False
            
            def check_application_readiness():
                """Check if application is ready to serve requests"""
                try:
                    # Just check if database is responding, don't check for specific data
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')  # Simple connectivity test
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True  # If we can connect and execute a query, we're ready
                except Exception as e:
                    print(f"Application readiness check failed: {e}")
                    return False
            
            def check_memory_usage():
                """Check if memory usage is within acceptable limits"""
                memory = psutil.virtual_memory()
                return memory.percent < 90  # Less than 90% memory usage
            
            def check_disk_space():
                """Check if disk space is sufficient"""
                disk = psutil.disk_usage('/')
                return disk.percent < 90  # Less than 90% disk usage
            
            def check_response_times():
                """Check if application response times are acceptable"""
                try:
                    start_time = time.time()
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    response_time = time.time() - start_time
                    return response_time < 2.0  # Less than 2 seconds
                except Exception:
                    return False
            
            # Request logging middleware
            @app.before_request
            def log_request():
                request.start_time = time.time()
            
            @app.after_request
            def log_response(response):
                duration = time.time() - request.start_time
                
                log_data = {
                    "timestamp": datetime.utcnow().isoformat(),
                    "method": request.method,
                    "path": request.path,
                    "status_code": response.status_code,
                    "duration_ms": round(duration * 1000, 2),
                    "user_agent": request.headers.get('User-Agent'),
                    "ip_address": request.remote_addr,
                    "deployment_color": '${deployment_color}',
                    "instance_id": get_instance_id()
                }
                
                logger.info(json.dumps(log_data))
                return response
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify({
                        'contacts': contacts,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    })
                except Exception as e:
                    logger.error(f"Database query failed: {str(e)}")
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                """Enhanced health check endpoint"""
                try:
                    # Database connectivity check
                    db_status = check_database_connection()
                    
                    # Application readiness check
                    app_status = check_application_readiness()
                    
                    # System health checks
                    memory_status = check_memory_usage()
                    disk_status = check_disk_space()
                    response_status = check_response_times()
                    
                    # Overall health status
                    all_healthy = all([db_status, app_status, memory_status, disk_status, response_status])
                    
                    health_data = {
                        'status': 'healthy' if all_healthy else 'unhealthy',
                        'checks': {
                            'database_connectivity': db_status,
                            'application_readiness': app_status,
                            'memory_usage': memory_status,
                            'disk_space': disk_status,
                            'response_times': response_status
                        },
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    }
                    
                    logger.info(f"Health check: {json.dumps(health_data)}")
                    return jsonify(health_data), 200 if all_healthy else 503
                except Exception as e:
                    logger.error(f"Health check failed: {str(e)}")
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/health/simple')
            def health_simple():
                """Simple health check for load balancer target groups"""
                try:
                    # Basic application check - just verify the app is running
                    # Don't check database or other services to keep it simple and fast
                    return jsonify({
                        'status': 'healthy',
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id(),
                        'message': 'Application is running'
                    }), 200
                except Exception as e:
                    logger.error(f"Simple health check failed: {str(e)}")
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    }), 500
            
            @app.route('/deployment/validate')
            def deployment_validation():
                """Comprehensive validation for new deployments"""
                try:
                    checks = {
                        'database_connectivity': check_database_connection(),
                        'application_functionality': check_application_readiness(),
                        'memory_usage': check_memory_usage(),
                        'disk_space': check_disk_space(),
                        'response_times': check_response_times()
                    }
                    
                    all_passed = all(checks.values())
                    
                    validation_data = {
                        'deployment_ready': all_passed,
                        'checks': checks,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': get_instance_id()
                    }
                    
                    logger.info(f"Deployment validation: {json.dumps(validation_data)}")
                    return jsonify(validation_data), 200 if all_passed else 503
                except Exception as e:
                    logger.error(f"Deployment validation failed: {str(e)}")
                    return jsonify({
                        'deployment_ready': False,
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/info')
            def info():
                """Instance information endpoint"""
                try:
                    memory = psutil.virtual_memory()
                    disk = psutil.disk_usage('/')
                    
                    return jsonify({
                        'deployment_color': '${deployment_color}',
                        'instance_id': get_instance_id(),
                        'system_info': {
                            'memory_usage_percent': memory.percent,
                            'disk_usage_percent': disk.percent,
                            'cpu_count': psutil.cpu_count(),
                            'uptime': time.time() - psutil.boot_time()
                        },
                        'timestamp': datetime.utcnow().isoformat()
                    })
                except Exception as e:
                    logger.error(f"Info endpoint failed: {str(e)}")
                    return jsonify({'error': str(e)}), 500
            
            # Chaos testing endpoints
            @app.route('/error/500')
            def generate_500_error():
                logger.error("Intentional 500 error generated for testing")
                return {"error": "Intentional server error"}, 500
            
            @app.route('/error/slow')
            def generate_slow_response():
                logger.warning("Intentional slow response generated for testing")
                time.sleep(3)  # Simulate slow database query
                return {"message": "Slow response completed"}
            
            @app.route('/error/db')
            def generate_db_error():
                logger.error("Intentional database error generated for testing")
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute("SELECT * FROM nonexistent_table")
                    cursor.fetchall()
                    cursor.close()
                    conn.close()
                except Exception as e:
                    logger.error(f"Database error: {str(e)}")
                    return {"error": "Database error", "details": str(e)}, 500
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Configure CloudWatch agent
            cat > /opt/aws/amazon-cloudwatch-agent/etc/amazon-cloudwatch-agent.json << 'EOF'
            {
              "logs": {
                "logs_collected": {
                  "files": {
                    "collect_list": [
                      {
                        "file_path": "/var/log/flask-app.log",
                        "log_group_name": "${application_log_group_name}",
                        "log_stream_name": "{instance_id}",
                        "timezone": "UTC"
                      },
                      {
                        "file_path": "/var/log/messages",
                        "log_group_name": "${system_log_group_name}",
                        "log_stream_name": "{instance_id}",
                        "timezone": "UTC"
                      }
                    ]
                  }
                }
              }
            }
            EOF
            
            # Start CloudWatch agent
            /opt/aws/amazon-cloudwatch-agent/bin/amazon-cloudwatch-agent-ctl \
              -a fetch-config \
              -m ec2 \
              -s \
              -c file:/opt/aws/amazon-cloudwatch-agent/etc/amazon-cloudwatch-agent.json
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            RestartSec=10
            StandardOutput=append:/var/log/flask-app.log
            StandardError=append:/var/log/flask-app.log
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
            
            # Wait for the application to start up
            echo "Waiting for application to start up..." >> /var/log/webapp-deployment.log
            sleep 30
            
            # Verify the application is running
            for i in {1..10}; do
                if curl -f http://localhost:8080/health/simple > /dev/null 2>&1; then
                    echo "Application is running and responding to health checks" >> /var/log/webapp-deployment.log
                    break
                else
                    echo "Attempt $i: Application not yet ready, waiting..." >> /var/log/webapp-deployment.log
                    sleep 10
                fi
            done
            
            # Create a simple health check script
            cat > /usr/local/bin/health-check.sh << 'EOF'
            #!/bin/bash
            curl -f http://localhost:8080/health > /dev/null 2>&1
            exit $?
            EOF
            
            chmod +x /usr/local/bin/health-check.sh
            
            # Log deployment information
            echo "Deployment completed for ${deployment_color} environment at $(date)" >> /var/log/webapp-deployment.log
            echo "Instance ID: $(curl -s http://169.254.169.254/latest/meta-data/instance-id)" >> /var/log/webapp-deployment.log
            echo "Deployment Color: ${deployment_color}" >> /var/log/webapp-deployment.log
            echo "Application startup sequence completed" >> /var/log/webapp-deployment.log
        EOT
      + vars     = {
          + "application_log_group_name" = "/aws/application/tf-playground/production"
          + "db_host"                    = (known after apply)
          + "db_name"                    = "tfplayground_prod"
          + "db_password"                = (sensitive value)
          + "db_user"                    = (sensitive value)
          + "deployment_color"           = "green"
          + "system_log_group_name"      = "/aws/ec2/tf-playground/production"
        }
    }

  # module.green_asg[0].aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "production-green-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "green"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "production-green-asg"
        }

      + traffic_source (known after apply)
    }

  # module.green_asg[0].aws_iam_instance_profile.asg will be created
  + resource "aws_iam_instance_profile" "asg" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "production-green-asg-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "production-green-asg-role"
      + tags_all    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.green_asg[0].aws_iam_policy.asg_rds will be created
  + resource "aws_iam_policy" "asg_rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to interact with RDS database"
      + id               = (known after apply)
      + name             = "production-green-asg-rds-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:rds:us-east-2:123324351829:db:production-*",
                          + "arn:aws:rds-db:us-east-2:123324351829:dbuser:production-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "production-green-asg-rds-policy"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-asg-rds-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.green_asg[0].aws_iam_policy.asg_secrets will be created
  + resource "aws_iam_policy" "asg_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to access database credentials in Secrets Manager"
      + id               = (known after apply)
      + name             = "production-green-asg-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/database/credentials-*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/db-pword",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/production/db-pword-*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/db-pword*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/ssh-key*",
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/ssh-key-public*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "production-green-asg-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-asg-secrets-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.green_asg[0].aws_iam_role.asg will be created
  + resource "aws_iam_role" "asg" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-green-asg-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "production-green-asg-role"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-asg-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.green_asg[0].aws_iam_role_policy.asg_cloudwatch will be created
  + resource "aws_iam_role_policy" "asg_cloudwatch" {
      + id          = (known after apply)
      + name        = "production-green-asg-cloudwatch-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/*",
                          + "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.green_asg[0].aws_iam_role_policy_attachment.asg_rds will be created
  + resource "aws_iam_role_policy_attachment" "asg_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-green-asg-role"
    }

  # module.green_asg[0].aws_iam_role_policy_attachment.asg_secrets will be created
  + resource "aws_iam_role_policy_attachment" "asg_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-green-asg-role"
    }

  # module.green_asg[0].aws_iam_role_policy_attachment.asg_ssm will be created
  + resource "aws_iam_role_policy_attachment" "asg_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "production-green-asg-role"
    }

  # module.green_asg[0].aws_launch_template.asg will be created
  + resource "aws_launch_template" "asg" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0c02fb55956c7d316"
      + instance_type   = "t3.micro"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "production-green-lt"
      + tags            = {
          + "Name" = "production-green-launch-template"
        }
      + tags_all        = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-launch-template"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "production-green-asg-profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "DeploymentColor" = "green"
              + "Environment"     = "production"
              + "Name"            = "production-green-instance"
            }
        }
    }

  # module.loadbalancer[0].aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "production-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "production-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.loadbalancer[0].aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name" = "production-alb-http-listener"
        }
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-http-listener"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.loadbalancer[0].aws_lb_listener_rule.green[0] will be created
  + resource "aws_lb_listener_rule" "green" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Name" = "production-green-listener-rule"
        }
      + tags_all     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-listener-rule"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/green*",
                  + "/green/*",
                ]
            }
        }
    }

  # module.loadbalancer[0].aws_lb_target_group.blue[0] will be created
  + resource "aws_lb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "production-blue-tg-ecs"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "production-blue-tg-ecs"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-blue-tg-ecs"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health/simple"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.loadbalancer[0].aws_lb_target_group.green[0] will be created
  + resource "aws_lb_target_group" "green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "production-green-tg-ecs"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "production-green-tg-ecs"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-green-tg-ecs"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health/simple"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.loadbalancer[0].aws_security_group_rule.alb_ecs_egress[0] will be created
  + resource "aws_security_group_rule" "alb_ecs_egress" {
      + description              = "Allow outbound traffic to ECS tasks on port 8080"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "egress"
    }

  # module.logging.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "tf-playground-production"
      + id             = (known after apply)
    }

  # module.logging.aws_cloudwatch_metric_alarm.high_error_rate[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "high_error_rate" {
      + actions_enabled                       = true
      + alarm_description                     = "High 5XX error rate detected"
      + alarm_name                            = "high-error-rate-production"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # module.logging.aws_cloudwatch_metric_alarm.slow_response_time[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "slow_response_time" {
      + actions_enabled                       = true
      + alarm_description                     = "Slow response time detected"
      + alarm_name                            = "slow-response-time-production"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + threshold                             = 2
      + treat_missing_data                    = "missing"
    }

  # module.networking.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Project"     = "tf-playground"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-gateway"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-gateway"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.networking.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "production-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database (MySQL from webservers)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "production-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.webserver will be created
  + resource "aws_security_group" "webserver" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers (HTTP, SSH, egress)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "production-webserver-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-webserver-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group_rule.alb_webserver_egress[0] will be created
  + resource "aws_security_group_rule" "alb_webserver_egress" {
      + description              = "Allow outbound traffic to webservers on port 8080"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "egress"
    }

  # module.networking.aws_security_group_rule.webserver_alb_ingress will be created
  + resource "aws_security_group_rule" "webserver_alb_ingress" {
      + description              = "Allow HTTP traffic on port 8080 from ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.networking.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Project"     = "tf-playground"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ssm[0].aws_iam_policy.ssm_automation will be created
  + resource "aws_iam_policy" "ssm_automation" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for SSM automation execution"
      + id               = (known after apply)
      + name             = "production-ssm-automation-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-policy"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

  # module.ssm[0].aws_iam_role.ssm_automation will be created
  + resource "aws_iam_role" "ssm_automation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-ssm-automation-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-ssm-automation-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ssm[0].aws_iam_role_policy_attachment.ssm_automation will be created
  + resource "aws_iam_role_policy_attachment" "ssm_automation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "production-ssm-automation-role"
    }

  # module.ssm[0].aws_ssm_document.database_automation will be created
  + resource "aws_ssm_document" "database_automation" {
      + arn              = (known after apply)
      + content          = <<-EOT
            schemaVersion: '0.3'
            assumeRole: '{{ AutomationAssumeRole }}'
            description: 'Automate database initialization with schema and sample data'
            parameters:
              DatabaseEndpoint:
                type: String
                description: RDS database endpoint
              DatabaseName:
                type: String
                description: Database name
              DatabaseUsername:
                type: String
                description: Database username
              DatabasePassword:
                type: String
                description: Database password
              InstanceId:
                type: String
                description: EC2 instance ID to run commands on
              AutomationAssumeRole:
                type: String
                description: IAM role ARN for automation execution
            mainSteps:
            - name: installDependencies
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Update system packages
                    yum update -y
                    
                    # Install MariaDB client if not already installed
                    if ! command -v mysql &> /dev/null; then
                        yum install -y mariadb1011-client-utils
                    fi
                    
                    echo "Dependencies installed successfully"
            - name: createDatabaseSchema
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Create database schema using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    CREATE TABLE IF NOT EXISTS contacts (
                        id INT AUTO_INCREMENT PRIMARY KEY,
                        name VARCHAR(100) NOT NULL,
                        email VARCHAR(100) NOT NULL UNIQUE,
                        phone VARCHAR(20),
                        created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
                    );
                    EOF
                    
                    echo "Database schema created successfully"
            - name: insertSampleData
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Insert sample data using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    INSERT IGNORE INTO contacts (name, email, phone) VALUES
                    ('John Doe', 'john.doe@example.com', '+1-555-0101'),
                    ('Jane Smith', 'jane.smith@example.com', '+1-555-0102'),
                    ('Bob Johnson', 'bob.johnson@example.com', '+1-555-0103'),
                    ('Alice Brown', 'alice.brown@example.com', '+1-555-0104'),
                    ('Charlie Wilson', 'charlie.wilson@example.com', '+1-555-0105');
                    EOF
                    
                    echo "Sample data inserted successfully"
            - name: verifyDatabaseSetup
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Verify the setup using environment variables
                    COUNT=$(mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" -s -N -e "SELECT COUNT(*) FROM contacts;")
                    echo "Database setup complete. Found $COUNT contacts in the database."
        EOT
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "YAML"
      + document_type    = "Automation"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "production-database-automation"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-automation-doc"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-database-automation-doc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "production"
        }
    }

Plan: 72 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                     = (known after apply)
  + alb_url                          = (known after apply)
  + alb_zone_id                      = (known after apply)
  + application_log_group_name       = "/aws/application/tf-playground/production"
  + application_url                  = (known after apply)
  + blue_asg_id                      = (known after apply)
  + blue_asg_name                    = "production-blue-asg"
  + blue_ecs_service_name            = "production-blue-service"
  + blue_target_group_arn            = (known after apply)
  + cloudwatch_dashboard_url         = "https://console.aws.amazon.com/cloudwatch/home?region=us-east-2#dashboards:name=tf-playground-production"
  + database_endpoint                = (known after apply)
  + database_name                    = "tfplayground_prod"
  + database_port                    = (known after apply)
  + db_password                      = (sensitive value)
  + db_secret_arn                    = "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/all/db-pword-EcXlE2"
  + db_secret_name                   = "/tf-playground/all/db-pword"
  + db_username                      = "tfplayground_user"
  + deployment_timestamp             = "Deployed via GitFlow CI/CD - Production Environment"
  + deployment_validation_url        = (known after apply)
  + ecr_repository_url               = "123324351829.dkr.ecr.us-east-2.amazonaws.com/global-tf-pg-ecr"
  + ecs_cluster_name                 = "production-ecs-cluster"
  + ecs_tasks_security_group_id      = (known after apply)
  + environment_summary              = {
      + alb_dns_name      = (known after apply)
      + application_url   = (known after apply)
      + blue_asg_name     = "production-blue-asg"
      + database_endpoint = (known after apply)
      + environment       = "production"
      + green_asg_name    = "production-green-asg"
      + region            = "us-east-2"
      + ssh_key_name      = "tf-playground-production-key"
      + vpc_id            = (known after apply)
    }
  + global_alarm_log_group_arn       = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/cloudwatch/alarms/tf-playground/production"
  + global_application_log_group_arn = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/tf-playground/production"
  + global_log_group_arns            = {
      + alarm       = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/cloudwatch/alarms/tf-playground/production"
      + application = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/tf-playground/production"
      + system      = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/tf-playground/production"
    }
  + global_system_log_group_arn      = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/tf-playground/production"
  + green_asg_id                     = (known after apply)
  + green_asg_name                   = "production-green-asg"
  + green_ecs_service_name           = "production-green-service"
  + green_target_group_arn           = (known after apply)
  + health_check_url                 = (known after apply)
  + high_error_rate_alarm_arn        = (known after apply)
  + http_listener_arn                = (known after apply)
  + private_subnet_ids               = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids                = [
      + (known after apply),
      + (known after apply),
    ]
  + slow_response_time_alarm_arn     = (known after apply)
  + ssh_key_name                     = "tf-playground-production-key"
  + ssh_private_key                  = (sensitive value)
  + ssh_public_key                   = (sensitive value)
  + ssm_automation_name              = "production-database-automation"
  + ssm_automation_role_arn          = (known after apply)
  + system_log_group_name            = "/aws/ec2/tf-playground/production"
  + vpc_id                           = (known after apply)

  ```
  
  </details>